# SQL Joins: TMDb Database
© Explore Data Science Academy

## Instructions to Students

This challenge is designed to determine how much you have learned so far and will test your knowledge on join SQL statements.

The answers for this challenge should be selected on Athena for each corresponding Multiple Choice Question. The questions are included in this notebook and are numbered according to the Athena Questions, the options to choose from for each question have also been included.

Do not add or remove cells in this notebook. Do not edit or remove the `%%sql` comment as it is required to run each cell.

**_Good Luck!_**

## Honour Code

I EDNA , KOBO, confirm - by submitting this document - that the solutions in this notebook are a result of my own work and that I abide by the EDSA honour code (https://drive.google.com/file/d/1QDCjGZJ8-FmJE3bZdIQNwnJyQKPhHZBn/view?usp=sharing).

Non-compliance with the honour code constitutes a material breach of contract.

## The TMDb Database

In this challenge you will be exploring the [The Movie Database](https://www.themoviedb.org/) - an online movie and TV show database, which houses some of the most popular movies and TV shows at your finger tips. The TMDb database supports 39 official languages used in over 180 countries daily and dates all the way back to 2008. 


<img src="https://github.com/Explore-AI/Pictures/blob/master/sql_tmdb.jpg?raw=true" width=80%/>


Below is an Entity Relationship diagram(ERD) of the TMDb database:

<img src="https://github.com/Explore-AI/Pictures/blob/master/TMDB_ER_diagram.png?raw=true" width=70%/>

As can be seen from the ER diagram, the TMDb database consists of `12 tables` containing information about movies, cast, genre and so much more.  

Let's get started!

## Loading the database

To begin and start making use of SQL queries you need to prepare your SQL environment you can do this by loading in the magic command `%load_ext sql`, next you can go ahead and load in your database. To do this you will need to ensure you have downloaded the `TMDB.db`sqlite file from Athena and have stored it in a known location. Now that you have all the prerequisites you can go ahead and load it into the notebook.

In [1]:
%load_ext sql

In [2]:
%%sql 

sqlite:///TMDB.db

## Questions on SQL Join Statements 

Use the given cell below each question to execute your SQL queries to find the correct input from the options provided for the multiple choice questions on Athena.

**Question 1**

What is the primary key for the table “movies”?

**Options:** 
 - title
 - movie_key
 - film_id
 - movie_id

**Solution**

In [53]:
import sqlite3

# Connect to the database
conn = sqlite3.connect('TMDB.db')

# Create a cursor
c = conn.cursor()

# Execute the query to show the schema of the movies table
c.execute("PRAGMA table_info(movies)")

# Fetch the results
results = c.fetchall()

# Print the results
for r in results:
    print(r)

# Close the connection
conn.close()

(0, 'movie_id', 'INTEGER', 1, None, 1)
(1, 'title', 'varchar(500)', 0, 'NULL', 0)
(2, 'release_date', 'datetime(6)', 0, 'NULL', 0)
(3, 'budget', 'INTEGER', 0, 'NULL', 0)
(4, 'homepage', 'varchar(500)', 0, 'NULL', 0)
(5, 'original_language', 'varchar(50)', 0, 'NULL', 0)
(6, 'original_title', 'varchar(500)', 0, 'NULL', 0)
(7, 'overview', 'varchar(5000)', 0, 'NULL', 0)
(8, 'popularity', 'double', 0, 'NULL', 0)
(9, 'revenue', 'double', 0, 'NULL', 0)
(10, 'runtime', 'double', 0, 'NULL', 0)
(11, 'release_status', 'varchar(50)', 0, 'NULL', 0)
(12, 'tagline', 'varchar(500)', 0, 'NULL', 0)
(13, 'vote_average', 'double', 0, 'NULL', 0)
(14, 'vote_count', 'INTEGER', 0, 'NULL', 0)

In [54]:
%%sql
PRAGMA table_info(movies);

 * sqlite:///TMDB.db
Done.

[(0, 'movie_id', 'INTEGER', 1, None, 1),
 (1, 'title', 'varchar(500)', 0, 'NULL', 0),
 (2, 'release_date', 'datetime(6)', 0, 'NULL', 0),
 (3, 'budget', 'INTEGER', 0, 'NULL', 0),
 (4, 'homepage', 'varchar(500)', 0, 'NULL', 0),
 (5, 'original_language', 'varchar(50)', 0, 'NULL', 0),
 (6, 'original_title', 'varchar(500)', 0, 'NULL', 0),
 (7, 'overview', 'varchar(5000)', 0, 'NULL', 0),
 (8, 'popularity', 'double', 0, 'NULL', 0),
 (9, 'revenue', 'double', 0, 'NULL', 0),
 (10, 'runtime', 'double', 0, 'NULL', 0),
 (11, 'release_status', 'varchar(50)', 0, 'NULL', 0),
 (12, 'tagline', 'varchar(500)', 0, 'NULL', 0),
 (13, 'vote_average', 'double', 0, 'NULL', 0),
 (14, 'vote_count', 'INTEGER', 0, 'NULL', 0)]

**Question 2**

How many foreign keys does the “LanguageMap” table have?

**Options:**

 - 0
 - 2
 - 3
 - 1

**Solution**

In [55]:
%%sql 
SELECT COUNT(*)
FROM sqlite_master
WHERE type = 'table' AND name = 'LanguageMap' AND sql LIKE '%FOREIGN KEY%';

 * sqlite:///TMDB.db
Done.

[(0,)]

**Question 3**

How many movies in the database were produced by Pixar Animation Studios?

**Options:**
 - 16
 - 14
 - 18
 - 20

**Solution**

In [62]:
import sqlite3

# Connect to the database
conn = sqlite3.connect('TMDB.db')

# Create a cursor
c = conn.cursor()

# Execute the query to show the schema of the production_company table
c.execute("PRAGMA table_info(production_company)")

# Fetch the results
results = c.fetchall()

# Print the results
for r in results:
    print(r)

# Close the connection
conn.close()

In [77]:
%%sql
SELECT COUNT(*) AS num_movies
FROM movies
JOIN production_companies ON movies.movie_id = production_companies.movie_id
WHERE production_companies.production_company_name = 'Pixar Animation Studios';

 * sqlite:///TMDB.db
(sqlite3.OperationalError) no such table: production_companies
[SQL: SELECT COUNT(*) AS num_movies
FROM movies
JOIN production_companies ON movies.movie_id = production_companies.movie_id
WHERE production_companies.production_company_name = 'Pixar Animation Studios';]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [64]:
%%sql
CREATE TABLE Movie (
  movie_id INT PRIMARY KEY,
  title VARCHAR(500),
  release_date DATE,
  runtime_minutes INT,
  budget INT,
  revenue INT,
  production_company_id INT,
  FOREIGN KEY (production_company_id) REFERENCES production_company (production_company_id)
);

 * sqlite:///TMDB.db
(sqlite3.OperationalError) table Movie already exists
[SQL: CREATE TABLE Movie (
  movie_id INT PRIMARY KEY,
  title VARCHAR(500),
  release_date DATE,
  runtime_minutes INT,
  budget INT,
  revenue INT,
  production_company_id INT,
  FOREIGN KEY (production_company_id) REFERENCES production_company (production_company_id)
);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

**Question 4**

What is the most popular action movie that has some German in it? (Hint: The German word for German is Deutsch)

**Options:**
 - The Bourne Identity
 - Mission: Impossible - Rogue Nation
 - Captain America: Civil War
 - Quantum of Solace

**Solution**

In [61]:
%%sql
SELECT title, popularity 
FROM movies 
WHERE original_language = 'Deutsch' AND title IN (
  SELECT title 
  FROM movies 
  WHERE original_language <> 'Deutsch' AND keywords LIKE '%action%' 
) 
ORDER BY popularity DESC 
LIMIT 1;

 * sqlite:///TMDB.db
(sqlite3.OperationalError) no such column: keywords
[SQL: SELECT title, popularity
FROM movies
WHERE original_language = 'Deutsch' AND title IN (
  SELECT title
  FROM movies
  WHERE original_language <> 'Deutsch' AND keywords LIKE '%action%'
)
ORDER BY popularity DESC
LIMIT 1;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

**Question 5**

In how many movies did Tom Cruise portray the character Ethan Hunt? (Hint: Characters are listed in the Casts table.)

**Options:**
 - 4
 - 3
 - 6
 - 5

**Solution**

In [11]:
%%sql 
SELECT COUNT(*) AS num_movies
FROM movies
JOIN casts ON movies.movie_id = casts.movie_id
WHERE casts.characters = 'Ethan Hunt' AND casts.actors_id IN (
    SELECT actors_id
    FROM actors
    WHERE actor_name = 'Tom Cruise'
);

 * sqlite:///TMDB.db
(sqlite3.OperationalError) no such column: actors_id
[SQL: SELECT COUNT(*) AS num_movies
FROM movies
JOIN casts ON movies.movie_id = casts.movie_id
WHERE casts.characters = 'Ethan Hunt' AND casts.actors_id IN (
    SELECT actors_id
    FROM actors
    WHERE actor_name = 'Tom Cruise'
);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

**Question 6**

How many times was the actress Cate Blanchett nominated for an Oscar?
 
 **Options:**
 - 7
 - 4
 - 5
 - 2

**Solution**

In [12]:
%%sql
SELECT COUNT (*) AS num_nominations
FROM awards
WHERE name = 'Cate Blanchett' AND award LIKE '%Actress%';

 * sqlite:///TMDB.db
(sqlite3.OperationalError) no such table: awards
[SQL: SELECT COUNT (*) AS num_nominations
FROM awards
WHERE name = 'Cate Blanchett' AND award LIKE '%Actress%';]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

**Question 7**

How many movies were nominated for the Best Picture award at the 2015 Oscars?
 
**Options:**

 - 12
 - 16
 - 8
 - 18

**Solution**

In [13]:
%%sql 
SELECT COUNT(*) AS num_nominees
FROM oscars
WHERE award = 'Best Picture' AND year = '2015';

 * sqlite:///TMDB.db
Done.

[(8,)]

**Question 8** 

How many movies contain at least one of the languages, Afrikaans or Zulu?

**Options:**
 - 10
 - 8
 - 12
 - 15

**Solution**

In [79]:
%%sql
SELECT name FROM sqlite_master WHERE type='table' AND name='spoken_languages';

 * sqlite:///TMDB.db
Done.

[]

In [75]:
%%sql
SELECT COUNT(DISTINCT m.movie_id) AS num_movies
FROM movies m
JOIN spoken_languages sl ON m.movie_id = sl.movie_id
WHERE sl.language_name = 'Afrikaans' OR sl.language_name = 'Zulu';

 * sqlite:///TMDB.db
(sqlite3.OperationalError) no such table: spoken_languages
[SQL: SELECT COUNT(DISTINCT m.movie_id) AS num_movies
FROM movies m
JOIN spoken_languages sl ON m.movie_id = sl.movie_id
WHERE sl.language_name = 'Afrikaans' OR sl.language_name = 'Zulu';]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

**Question 9**

In which country was the movie “Star Wars” produced?  

**Options:**
 - Canada
 - United Kingdom
 - France
 - United States of America

**Solution**

In [73]:
%%sql
SELECT name FROM sqlite_master WHERE type='table' AND name='production_countries';

 * sqlite:///TMDB.db
Done.

[]

In [74]:
%%sql 
CREATE TABLE production_countries (
    movie_id INTEGER,
    iso_3166_1 TEXT,
    FOREIGN KEY (movie_id) REFERENCES movies(movie_id)
);

 * sqlite:///TMDB.db
Done.

[]

**Question 10**

How many movies are in the database that are both a Romance and a Comedy?

**Options:**

 - 373
 - 484
 - 262
 - 595

**Solution**

In [72]:
%%sql
CREATE TABLE movie_genre (
    movie_id INTEGER,
    genre_id INTEGER,
    FOREIGN KEY (movie_id) REFERENCES movies(movie_id),
    FOREIGN KEY (genre_id) REFERENCES genre(genre_id)
);

 * sqlite:///TMDB.db
Done.

[]